### Pandas 기초

In [63]:
import pandas as pd
import numpy as np

In [64]:
s = pd.Series([1,3,5,np.nan,6,8]) #NaN은 아무것도 없는(빈) 값
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [65]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [66]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = ['A', 'B', 'C', 'D']) #DataFrame은 딕셔너리나 array형 자료를 받습니다
df

                   A         B         C         D
2013-01-01  0.244006  1.630019  0.488647 -1.977967
2013-01-02 -1.944095 -1.498537  0.315895  0.082514
2013-01-03 -3.270669  0.802678 -0.333694 -0.349371
2013-01-04 -0.831339 -0.015150  0.538397  0.274917
2013-01-05  0.180354  0.415049  0.059333 -0.429260
2013-01-06  0.266953 -0.084247 -0.358940  0.343294

In [8]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [10]:
df.values

array([[ 0.88986198,  1.47624973, -0.14901053,  0.2396956 ],
       [ 2.68472319, -0.10361702,  0.43021154,  0.69423324],
       [-1.04502083, -0.90524218,  1.61876713, -0.3336731 ],
       [ 1.33392214,  2.65919773,  0.26035726,  0.90836849],
       [ 0.81006963,  1.56620791, -1.60301144, -0.21389352],
       [-1.01401063,  0.41985553, -2.81352095, -0.00973754]])

In [11]:
df.describe() #각종 요약값 제공

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.609924  0.852109 -0.376035  0.214166
std    1.436899  1.292563  1.583200  0.499305
min   -1.045021 -0.905242 -2.813521 -0.333673
25%   -0.557991  0.027251 -1.239511 -0.162855
50%    0.849966  0.948053  0.055673  0.114979
75%    1.222907  1.543718  0.387748  0.580599
max    2.684723  2.659198  1.618767  0.908368

In [12]:
df.sort_values(by = 'B', ascending = False)

                   A         B         C         D
2013-01-04  1.333922  2.659198  0.260357  0.908368
2013-01-05  0.810070  1.566208 -1.603011 -0.213894
2013-01-01  0.889862  1.476250 -0.149011  0.239696
2013-01-06 -1.014011  0.419856 -2.813521 -0.009738
2013-01-02  2.684723 -0.103617  0.430212  0.694233
2013-01-03 -1.045021 -0.905242  1.618767 -0.333673

In [13]:
df['B']

2013-01-01    1.476250
2013-01-02   -0.103617
2013-01-03   -0.905242
2013-01-04    2.659198
2013-01-05    1.566208
2013-01-06    0.419856
Freq: D, Name: B, dtype: float64

In [14]:
df[0:3] #슬라이싱은 행 단위로 실행

                   A         B         C         D
2013-01-01  0.889862  1.476250 -0.149011  0.239696
2013-01-02  2.684723 -0.103617  0.430212  0.694233
2013-01-03 -1.045021 -0.905242  1.618767 -0.333673

In [15]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  2.684723 -0.103617  0.430212  0.694233
2013-01-03 -1.045021 -0.905242  1.618767 -0.333673
2013-01-04  1.333922  2.659198  0.260357  0.908368

In [16]:
df.loc[dates[0]]

A    0.889862
B    1.476250
C   -0.149011
D    0.239696
Name: 2013-01-01 00:00:00, dtype: float64

In [17]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.889862  1.476250
2013-01-02  2.684723 -0.103617
2013-01-03 -1.045021 -0.905242
2013-01-04  1.333922  2.659198
2013-01-05  0.810070  1.566208
2013-01-06 -1.014011  0.419856

In [18]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  2.684723 -0.103617
2013-01-03 -1.045021 -0.905242
2013-01-04  1.333922  2.659198

In [19]:
df.loc[dates[0], 'A']

0.8898619810008503

In [20]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.333922  2.659198
2013-01-05  0.810070  1.566208

In [21]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  2.684723  0.430212
2013-01-03 -1.045021  1.618767
2013-01-05  0.810070 -1.603011

In [22]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  2.684723 -0.103617  0.430212  0.694233
2013-01-03 -1.045021 -0.905242  1.618767 -0.333673

In [59]:
index = df['A'] > 0

In [61]:
index

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [60]:
df[index]

                   A         B         C         D
2013-01-02  0.193109 -0.238293 -0.721110  1.198863
2013-01-04  0.284123  0.714056  0.655315  1.161326
2013-01-05  1.376297  0.715828  0.152671 -1.241288

In [25]:
df[df>0] #value가 0이상인 값만 반환하고 이외에는 NaN 형태로 반환

                   A         B         C         D
2013-01-01  0.889862  1.476250       NaN  0.239696
2013-01-02  2.684723       NaN  0.430212  0.694233
2013-01-03       NaN       NaN  1.618767       NaN
2013-01-04  1.333922  2.659198  0.260357  0.908368
2013-01-05  0.810070  1.566208       NaN       NaN
2013-01-06       NaN  0.419856       NaN       NaN

In [26]:
df2 = df.copy() #원본 df에는 변화를 적용하고 싶지 않다면 copy()를 사용해야 한다. 그냥 df2 = df로 하면 df2에 적용된 코드가 df에도 적용됨.
df2

                   A         B         C         D
2013-01-01  0.889862  1.476250 -0.149011  0.239696
2013-01-02  2.684723 -0.103617  0.430212  0.694233
2013-01-03 -1.045021 -0.905242  1.618767 -0.333673
2013-01-04  1.333922  2.659198  0.260357  0.908368
2013-01-05  0.810070  1.566208 -1.603011 -0.213894
2013-01-06 -1.014011  0.419856 -2.813521 -0.009738

In [27]:
df2['E'] = ['one', 'two', 'three', 'four', 'five', 'six']

In [28]:
df2

                   A         B         C         D      E
2013-01-01  0.889862  1.476250 -0.149011  0.239696    one
2013-01-02  2.684723 -0.103617  0.430212  0.694233    two
2013-01-03 -1.045021 -0.905242  1.618767 -0.333673  three
2013-01-04  1.333922  2.659198  0.260357  0.908368   four
2013-01-05  0.810070  1.566208 -1.603011 -0.213894   five
2013-01-06 -1.014011  0.419856 -2.813521 -0.009738    six

In [29]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [30]:
df2[df2['E'].isin(['two', 'four'])] #'E'행의 값이 'two'나 'four'인 열들을 반환

                   A         B         C         D     E
2013-01-02  2.684723 -0.103617  0.430212  0.694233   two
2013-01-04  1.333922  2.659198  0.260357  0.908368  four

In [31]:
df2.drop('E',axis = 1)

                   A         B         C         D
2013-01-01  0.889862  1.476250 -0.149011  0.239696
2013-01-02  2.684723 -0.103617  0.430212  0.694233
2013-01-03 -1.045021 -0.905242  1.618767 -0.333673
2013-01-04  1.333922  2.659198  0.260357  0.908368
2013-01-05  0.810070  1.566208 -1.603011 -0.213894
2013-01-06 -1.014011  0.419856 -2.813521 -0.009738

In [32]:
df2

                   A         B         C         D      E
2013-01-01  0.889862  1.476250 -0.149011  0.239696    one
2013-01-02  2.684723 -0.103617  0.430212  0.694233    two
2013-01-03 -1.045021 -0.905242  1.618767 -0.333673  three
2013-01-04  1.333922  2.659198  0.260357  0.908368   four
2013-01-05  0.810070  1.566208 -1.603011 -0.213894   five
2013-01-06 -1.014011  0.419856 -2.813521 -0.009738    six

In [33]:
df2 = df2.drop('E',axis = 1)

### DataFrame 병합하기

#### concat

In [34]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                   'D': ['D0', 'D1', 'D2', 'D3']},
                  index = [0,1,2,3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B': ['B4', 'B5', 'B6', 'B7'],
                   'C': ['C4', 'C5', 'C6', 'C7'],
                   'D': ['D4', 'D5', 'D6', 'D7']},
                  index = [4,5,6,7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8', 'B9', 'B10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                   'D': ['D8', 'D9', 'D10', 'D11']},
                  index = [8,9,10,11])

In [35]:
result = pd.concat([df1, df2, df3]) #열 방향으로 dataframe을 병합
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [36]:
result = pd.concat([df1, df2, df3], keys = ['x', 'y','z']) #key는 인덱스와 비슷하다고 보면 됩니다
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [37]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [38]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [39]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [40]:
left = pd.DataFrame({'key': ['K0','K4','K2','K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

#### join

In [41]:
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [42]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [43]:
pd.merge(left, right, on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [44]:
pd.merge(left, right, how = 'left', on = 'key') #왼쪽 데이터프레임을 기준으로 병합

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [45]:
pd.merge(left, right, how = 'right', on = 'key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

In [46]:
pd.merge(left, right, how = 'outer', on = 'key') #how 값의 기본 옵션은 inner(교집합)이다

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

### DataFrame 저장하고 불러오기

In [47]:
df = pd.merge(left, right, how = 'outer', on = 'key')

In [48]:
df

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

#### 'C:/Users/NH/SoomgoKES/data' 폴더에 df라는 csv 파일로 저장된다.

In [62]:
df.to_csv('data/df.csv',index = False) # index는 저장하지 않겠다는 뜻

In [50]:
import os

In [51]:
os.getcwd()

'C:\\Users\\DongKeon\\SoomgoKES'

In [52]:
df = pd.read_csv('data/df.csv', index_col = 0)

In [53]:
df

       A    B    C    D
key
K0    A0   B0   C0   D0
K4    A1   B1  NaN  NaN
K2    A2   B2   C2   D2
K3    A3   B3   C3   D3
K1   NaN  NaN   C1   D1